text = "  hello world  "
print(text.strip())  
text = "---hello---"
print(text.strip("-"))  #Ця функція видаляє символи "-" з початку і кінця рядка
print("----------------------------------------------------")

text2="PYTHON IS A Programming language"
print(text2.capitalize())  # Ця функція робить першу букву рядка великою, а всі інші - маленькими
print("----------------------------------------------------")

text3="nice to meet you"
print(text3.title())    # Ця функція робить першу букву кожного слова великою
print("----------------------------------------------------")

text4="good job"
print(text4.upper())  # Ця функція робить всі літери рядка великими
print("----------------------------------------------------")

text5="HELLO EVERYONE"
print(text5.lower())  # Ця функція робить всі літери рядка маленькими
print("----------------------------------------------------")